app/controllers/students_controller.rb

INSERT INTO "students" ("last_name", "first_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["last_name", "Metelskyi"], ["first_name", "Artem"], ["created_at", "2019-02-03 22:22:52.295837"], ["updated_at", "2019-02-03 22:22:52.295837"]]
---
    def create
      @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "last_name" = ?, "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Stanojlovichhhqqq"], ["first_name", "Irenasssss"], ["updated_at", "2019-02-03 23:26:47.536911"], ["id", 9]]
---
    def update
      @student = Student.find(params[:id])
      @student.update(params.require(:student))